examples_prescribed_oscillation/3D_RM6_oscil_surge/T20/Allrun.ser
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------#

# Clean the run directory
./Allclean

# Run preparation steps 
./Allrun.pre
if [ $? -ne 0 ]; then
  exit 1
fi

# Run the interFoam solver
$(getApplication) | tee log.overInterDyMFoam

#------------------------------------------------------------------------------#
